app/controllers/drives_controller.rb

SELECT `drives`.* FROM `drives`
---
    def index
        @drives = Drive.all