app/controllers/home_controller.rb

SELECT `drives`.* FROM `drives`
---
    def index
      @servers = Server.all
      @drives = Drive.all