app/controllers/servers_controller.rb

  def index
    @servers = Server.all
---
SELECT `servers`.* FROM `servers`

  def show
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @server = Server.new(server_params)

    if @server.save
---
INSERT INTO "servers" ("title", "model_number", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test123"], ["model_number", "123456"], ["description", "Testing Server"], ["created_at", "2022-10-13 00:58:07.505078"], ["updated_at", "2022-10-13 00:58:07.505078"]]

  def edit
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @server = Server.find(params[:id])
    @server.destroy
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = ?  [["id", 1]]